Repository: Christentimmy/FalangThai
Catalog: lib/l10n/app_*.arb
Languages: th

source: welcome Back
th: ยินดีต้อนรับกลับ

# loginText1
source: Sign in to continue your journey
th: เข้าสู่ระบบเพื่อใช้งานต่อ

source: Email Address
th: อีเมล

source: Password
th: รหัสผ่าน

source: Forgot Password?
th: ลืมรหัสผ่าน?

source: Sign In
th: เข้าสู่ระบบ

source: Or continue with
th: หรือต่อด้วย

# dontHaveAccount
source: Don't have an account?
th: ยังไม่มีบัญชี?

source: Sign Up
th: สมัครสมาชิก

source: Loading...
th: กำลังโหลด...

# createAccountTitle
source: Create Account
th: สร้างบัญชี

# createAccountSubtitle
source: Join our community and start connecting
th: เข้าร่วมชุมชนของเราและเริ่มเชื่อมต่อ

source: Full Name
th: ชื่อ-นามสกุล

source: Email
th: อีเมล

# iAgreeTo
source: I agree to the
th: ฉันยอมรับ

source: Terms of Service
th: ข้อกำหนดการให้บริการ

source: and
th: และ

source: Privacy Policy
th: นโยบายความเป็นส่วนตัว

# alreadyHaveAccount
source: Already have an account?
th: มีบัญชีแล้วหรือไม่?

# verificationTitle
source: Verification
th: ยืนยันตัวตน

# otpHeadingPrefix
source: Enter your
th: กรอก

# otpHeadingOtp
source: OTP
th: รหัส OTP ของคุณ

# otpSentTo
source: A verification code has been sent to
th: รหัสยืนยันได้ถูกส่งไปที่

source: Wrong details?
th: รายละเอียดไม่ถูกต้อง?

source: Change
th: แก้ไข

# continueText
source: Continue
th: ดำเนินการต่อ

# didntReceiveCode
source: Didn't receive the code?
th: ยังไม่ได้รับรหัสใช่ไหม?

source: Resend
th: ส่งใหม่

source: Skip
th: ข้าม

# genderTitle
source: What's your gender?
th: เพศของคุณคืออะไร?

# genderSubtitle
source: Help us personalize your experience by selecting your gender
th: ช่วยให้เราปรับประสบการณ์ให้เหมาะกับคุณ โดยการเลือกเพศของคุณ

source: Male
th: ชาย

source: Female
th: หญิง

source: Others
th: อื่นๆ

source: Prefer not to say
th: ไม่ต้องการระบุ

# locationRequestTitle
source: Location Request
th: คำขอใช้ตำแหน่งที่ตั้ง

# locationRequestBody
source: To help you find meaningful connections nearby, we need access to your location. Our dating algorithm uses your location to: • Show you potential matches in your area • Calculate accurate distance between you and other users • Provide better match suggestions based on proximity • Enable location-based features and events Your location data is always kept private and encoded.
th: เพื่อช่วยให้คุณพบคนรู้จักใกล้ตัวได้ดีขึ้น เราจำเป็นต้องเข้าถึงตำแหน่งที่ตั้งของคุณ อัลกอริทึมจับคู่ของเราใช้ตำแหน่งของคุณเพื่อ: • แสดงโปรไฟล์ที่อยู่ในบริเวณใกล้เคียง • คำนวณระยะห่างที่แม่นยำระหว่างคุณกับผู้ใช้คนอื่น • แนะนำคู่ที่เหมาะสมยิ่งขึ้นตามระยะทาง • เปิดใช้ฟีเจอร์และกิจกรรมต่าง ๆ ตามตำแหน่งที่ตั้ง ข้อมูลตำแหน่งของคุณจะถูกเก็บเป็นความลับและเข้ารหัสเสมอ.

source: Allow Location
th: อนุญาตตำแหน่งที่ตั้ง

# addYourPhotoTitle
source: Add your photo
th: เพิ่มรูปภาพของคุณ

# addYourPhotoSubtitle
source: Show the world your beautiful smile! This helps others recognize you
th: แสดงรอยยิ้มที่สวยงามของคุณให้ทุกคนได้เห็น! สิ่งนี้ช่วยให้ผู้อื่นจดจำคุณได้

# dateOfBirthPlaceholder
source: Date of birth
th: วันเดือนปีเกิด

# bioPlaceholder
source: Bio
th: แนะนำตัว

source: What are your hobbies?
th: งานอดิเรกของคุณคืออะไร?

# hobbiesSubtitle
source: Help others discover what makes you unique! Select activities you love and enjoy
th: ช่วยให้คนอื่นรู้จักตัวตนของคุณมากขึ้น! เลือกกิจกรรมที่คุณชอบและสนุกกับมัน

# hobbiesSelectionCounter
source: {count} hobbies selected
th: เลือกแล้ว {count} งานอดิเรก

source: Reading
th: การอ่านหนังสือ

source: Music
th: ดนตรี

source: Cooking
th: ทำอาหาร

source: Travel
th: ท่องเที่ยว

source: Photography
th: ถ่ายภาพ

source: Sports
th: กีฬา

source: Gaming
th: เล่นเกม

source: Art
th: ศิลปะ

source: Fitness
th: ออกกำลังกาย

source: Movies
th: ดูหนัง

source: Dancing
th: เต้น

source: Gardening
th: จัดสวน

source: Writing
th: การเขียน

# tech
source: Technology
th: เทคโนโลยี

source: Fashion
th: แฟชั่น

source: Volunteering
th: อาสาสมัคร

source: Select at least 3 hobbies
th: โปรดเลือกงานอดิเรกอย่างน้อย 3 อย่าง

# selectMoreHobbies
source: Select {count} more hobbies
th: เลือกเพิ่มอีก {count} งานอดิเรก

# hobbiesSelected
source: {count}/8 hobbies selected
th: เลือกแล้ว {count}/8 งานอดิเรก

source: Maximum Selection
th: จำนวนสูงสุด

source: You can select up to 8 hobbies only
th: คุณสามารถเลือกงานอดิเรกได้สูงสุด 8 อย่างเท่านั้น

source: Edit Hobbies
th: แก้ไขงานอดิเรก

# relationshipTitle
source: Who interests you?
th: คุณสนใจใคร?

# relationshipSubtitle
source: Select preferences that apply to help us find your perfect matches
th: เลือกตัวเลือกที่ตรงกับคุณเพื่อช่วยให้เราค้นหาคู่ที่ใช่ให้คุณ

# prefMen
source: Men
th: ผู้ชาย

# prefWomen
source: Women
th: ผู้หญิง

# prefNonBinary
source: Non-binary
th: นอนไบนารี

# prefTransgender
source: Transgender
th: ทรานส์เจนเดอร์

# prefEveryone
source: Everyone
th: ทุกคน

source: No matches found
th: ไม่พบคู่ที่ตรงกัน

source: No users found
th: ไม่พบผู้ใช้

# likesTitle
source: Likes
th: รายการถูกใจ

# matchesTitle
source: Matches
th: คู่ที่ตรงกัน

source: No conversations yet
th: ยังไม่มีการสนทนา

source: Start chatting with your matches!
th: เริ่มแชทกับคู่แมตช์ของคุณได้เลย!

# chatsTitle
source: Chats
th: แชท

# settingsTitle
source: Settings
th: การตั้งค่า

# settingsSectionGeneral
source: General
th: ทั่วไป

# settingsEditProfile
source: Edit Profile
th: แก้ไขโปรไฟล์

# settingsWallet
source: Wallet
th: กระเป๋าเงิน

# settingsLanguage
source: Language
th: ภาษา

# settingsInvite
source: Invite
th: เชิญเพื่อน

# settingsSecurity
source: Security
th: ความปลอดภัย

# settingsSectionSupport
source: Support
th: การช่วยเหลือ

# settingsSubscription
source: Subscription
th: การสมัครสมาชิก

# settingsPrivacy
source: Privacy
th: ความเป็นส่วนตัว

# settingsTermsAndConditions
source: Terms & Conditions
th: เงื่อนไขและข้อตกลง

# settingsSectionAccount
source: Account
th: บัญชี

# settingsReportProblem
source: Report a problem
th: รายงานปัญหา

# settingsLogout
source: Logout
th: ออกจากระบบ

# profileTitle
source: Profile
th: โปรไฟล์

# profileInterestsSection
source: Interests
th: ความสนใจ

# profilePhotosSection
source: Photos
th: รูปภาพ

# profilePreferencesSection
source: Preferences
th: การตั้งค่าคู่แมตช์

# profileAgeRange
source: Age Range
th: ช่วงอายุ

# profileDistance
source: Distance
th: ระยะทาง

# profileLookingFor
source: Looking for
th: กำลังมองหา

# profileInterestedIn
source: Interested In
th: สนใจ

# profileLikesStat
source: Likes
th: ถูกใจ

# profileViewsStat
source: Views
th: เข้าชม

# profileMatchesStat
source: Matches
th: คู่แมตช์

# profileBioPlaceholder
source: Tell us about yourself...
th: เล่าเกี่ยวกับตัวคุณให้เรารู้จักมากขึ้น...

# walletTitle
source: Wallet
th: กระเป๋าเงิน

# walletAvailableBalance
source: Available Balance
th: ยอดเงินคงเหลือ

# walletTotalEarned
source: Total Earned
th: รายได้รวม

# walletWithdrawn
source: Withdrawn
th: ที่ถอนออกไปแล้ว

# walletWithdrawFunds
source: Withdraw Funds
th: ถอนเงิน

# walletWithdrawFundsSubtitle
source: Transfer money to your account
th: โอนเงินเข้าบัญชีของคุณ

# walletPaymentMethods
source: Payment Methods
th: วิธีชำระเงิน

# walletPaymentMethodsSubtitle
source: Manage your payment accounts
th: จัดการบัญชีการชำระเงินของคุณ

# walletTransactionHistory
source: Transaction History
th: ประวัติธุรกรรม

# walletTransactionHistorySubtitle
source: View all transactions
th: ดูธุรกรรมทั้งหมด

# withdrawAmountLabel
source: Withdrawal Amount
th: จำนวนเงินที่ต้องการถอน

# withdrawAmountHint
source: Enter amount
th: กรอกจำนวนเงิน

# withdrawMethodLabel
source: Withdrawal Method
th: วิธีการถอนเงิน

# withdrawBankTransfer
source: Bank Transfer
th: โอนผ่านธนาคาร

# withdrawBankAccountNotSet
source: Not set
th: ยังไม่ได้ตั้งค่า

# withdrawNoPaymentMethods
source: No payment methods available. Please add one first.
th: ยังไม่มีวิธีชำระเงิน กรุณาเพิ่มก่อน

# withdrawProcessingInfo
source: Withdrawals typically process within 3-5 business days
th: โดยปกติการถอนใช้เวลา 3-5 วันทำการ

# withdrawAllLabel
source: All
th: ทั้งหมด

# withdrawErrorTitle
source: Error
th: ข้อผิดพลาด

# withdrawErrorInvalidAmount
source: Please enter a valid amount
th: กรุณากรอกจำนวนเงินให้ถูกต้อง

# withdrawErrorInsufficientBalance
source: Insufficient balance
th: ยอดเงินคงเหลือไม่เพียงพอ

# withdrawErrorNoMethod
source: Please select a withdrawal method
th: กรุณาเลือกวิธีการถอนเงิน

# withdrawConfirmTitle
source: Confirm Withdrawal
th: ยืนยันการถอนเงิน

# withdrawConfirmMessage
source: Withdraw {amount} to your {method} account?
th: ต้องการถอน {amount} ไปยังบัญชี {method} ของคุณหรือไม่?

# withdrawCancel
source: Cancel
th: ยกเลิก

# withdrawConfirmButton
source: Confirm
th: ยืนยัน

# paymentConfigured
source: Configured
th: ตั้งค่าแล้ว

# paymentNotConfigured
source: Not configured
th: ยังไม่ได้ตั้งค่า

# paymentStatusActive
source: Active
th: ใช้งานอยู่

# paymentStatusSetup
source: Setup
th: ตั้งค่า

# paymentDetailsAccountHolder
source: Account Holder
th: ชื่อเจ้าของบัญชี

# paymentDetailsAccountNumber
source: Account Number
th: เลขที่บัญชี

# paymentDetailsBankName
source: Bank Name
th: ชื่อธนาคาร

# paymentDetailsEmail
source: Email
th: อีเมล

# paymentEditDetails
source: Edit Details
th: แก้ไขรายละเอียด

# paymentAddMethod
source: Add Method
th: เพิ่มวิธีชำระเงิน

# bankTransferAccountHolderLabel
source: Account Holder Name
th: ชื่อเจ้าของบัญชี

# bankTransferAccountHolderHint
source: Enter full name
th: กรอกชื่อ-นามสกุลเต็ม

# bankTransferAccountNumberLabel
source: Account Number
th: เลขที่บัญชี

# bankTransferAccountNumberHint
source: Enter account number
th: กรอกเลขที่บัญชี

# bankTransferBankNameLabel
source: Bank Name
th: ชื่อธนาคาร

# bankTransferBankNameHint
source: Enter bank name
th: กรอกชื่อธนาคาร

# bankTransferSaveChanges
source: Save Changes
th: บันทึกการเปลี่ยนแปลง

# paypalAccountTitle
source: PayPal Account
th: บัญชี PayPal

# paypalEmailLabel
source: PayPal Email
th: อีเมล PayPal

# paypalEmailHint
source: Enter PayPal email address
th: กรอกอีเมล PayPal

# paypalInfoVerified
source: Make sure this email is verified with your PayPal account
th: โปรดตรวจสอบว่าอีเมลนี้ได้รับการยืนยันกับบัญชี PayPal ของคุณแล้ว

# paypalSaveChanges
source: Save Changes
th: บันทึกการเปลี่ยนแปลง

# transactionHistoryTitle
source: Transaction History
th: ประวัติธุรกรรม

# transactionHistoryEmpty
source: No transactions found
th: ไม่พบธุรกรรม

# transactionStatusCompleted
source: Completed
th: เสร็จสมบูรณ์

# transactionStatusPending
source: Pending
th: รอดำเนินการ

# transactionFilterRecent
source: Recent
th: ล่าสุด

# transactionFilterWithdrawals
source: Withdrawals
th: การถอนเงิน

# transactionFilterCommissions
source: Commissions
th: ค่าคอมมิชชั่น

# inviteStatsTitle
source: Invitation Statistics
th: สถิติการเชิญ

# inviteRecentInvites
source: Recent Invites
th: การเชิญล่าสุด

# inviteTotalInvites
source: {count} total
th: ทั้งหมด {count} คน

# inviteEmptyTitle
source: No invites yet
th: ยังไม่มีการเชิญ

# inviteEmptySubtitle
source: Start inviting friends to earn rewards!
th: เริ่มเชิญเพื่อนเพื่อรับรางวัลกันเถอะ!

# inviteYourCode
source: Your Code
th: โค้ดของคุณ

# inviteTapToCopy
source: Tap to copy
th: แตะเพื่อคัดลอก

# inviteCopied
source: Code copied to clipboard
th: คัดลอกโค้ดแล้ว

# inviteErrorNoCode
source: No invite code available yet
th: ยังไม่มีรหัสเชิญ

# inviteImpactTitle
source: Your Impact
th: ผลลัพธ์จากการเชิญของคุณ

# inviteStatTotalInvitesLabel
source: Total Invites
th: จำนวนการเชิญทั้งหมด

# inviteStatCreditsEarnedLabel
source: Credits Earned
th: เครดิตที่ได้รับ
